using System;

/*
Напишите метод создания двунаправленного списка, 
в информационные поля элементов которого последовательно заносятся номера с 1 до N (N водится с клавиатуры). 
Элементы, содержащие отрицательные значения, заносятся всегда в конец списка, 
а положительные – в начало (в порядке считывания из файла), нулевые – между положительными и отрицательными. 
Разработайте методы поиска и удаления элементов списка.
*/

namespace Task9
{
    class Program
    {
        static void Main(string[] args)
        {

        }
    }
}